
## Plan Result (aat)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.vault.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0]
  * module.vault.azurerm_user_assigned_identity.managed_identity[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.vault.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0] will be created
  + resource "azurerm_key_vault_access_policy" "implicit_managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/docmosis-infrastructure-aat/providers/Microsoft.KeyVault/vaults/docmosis-infra-aat"
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.vault.azurerm_user_assigned_identity.managed_identity[0] will be created
  + resource "azurerm_user_assigned_identity" "managed_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "docmosis-aat-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-aat-rg"
      + tags                = {
          + "application"         = "docmosis"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/docmosis-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#platops-help"
          + "environment"         = "staging"
          + "managedBy"           = "CNP"
        }
      + tenant_id           = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":6,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->